Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །གང་གི་འདུ་ཤེས་འབྱུང་བ་ནི།
en: “When a conception arises for anyone,

source: །སངས་རྒྱས་ཀྱིས་ཀྱང་ཆོས་མ་བརྙེས།
en: Even a buddha could not find any such phenomenon.

source: །འདིར་ནི་དོན་དེ་བསམ་པར་གྱིས།
en: Contemplate the meaning of this

source: །དེ་ནས་འདུ་ཤེས་མེད་པར་འགྱུར།
en: And there will be no conception. {96}

source: །ནམ་ཚེ་འདུ་ཤེས་སྐྱེས་པ་ན།
en: “When does a conception arise?

source: །སུ་ཡི་འདུ་ཤེས་ཡིན་ཞེས་བརྗོད།
en: For whom does the conception appear? How does liberation arise

source: །སེམས་ཀྱི་རྒྱུད་ཀྱི་རྣམ་ཐར་ཡང་། །དེ་ལ་ཇི་ལྟར་རུང་བར་འགྱུར།
en: In the process of the mind? {97}

source: །གང་ཚེ་རྣམ་ཐར་རེག་པ་ན།
en: “When liberation is experienced,

source: །བསམ་པ་ཐམས་ཅད་བསམ་པ་མེད།
en: All thoughts become nonthought.

source: །གང་ཚེ་བསམ་པ་བསམ་མེད་པ།
en: When thoughts become nonthought,

source: །དེ་ཚེ་བསམ་དུ་མེད་པར་འགྱུར།
en: At that time there is nonthought. {98}

source: །བསམ་པའི་ས་ལ་གནས་ནས་ནི།
en: “When one is on the level of thoughts,

source: །མཐར་གྱིས་རྣམ་པར་བསམ་བྱས་ཏེ།
en: Having thus contemplated,

source: །བསམ་པ་ཐམས་ཅད་རྣམ་སྤངས་ནས།
en: All thoughts are eliminated

source: །དེ་ནས་བསམ་དུ་མེད་པར་འགྱུར།
en: And there is nonthought. {99}

source: །འདི་ནི་དཀར་ཆོས་རྣམ་སྨིན་ཏེ།
en: “This is the ripening of good qualities,

source: །འདུ་བྱེད་མེད་པས་མཐོང་བར་འགྱུར།
en: Which is seen without mentation,

source: །སེམས་ཅན་ཀུན་གྱིས་རྣམ་བསམ་པ།
en: And the thoughts of all beings

source: །སྐད་ཅིག་གཅིག་ལ་རབ་ཏུ་ཤེས།
en: Are known in a single instant. {100}

source: །སེམས་ཅན་ཅི་འདྲ་དེ་བཞིན་བསམ།
en: “As beings are, so are their thoughts;

source: །བསམ་བཞིན་རྒྱལ་བ་དེ་འདྲ་སྟེ།
en: As are their thoughts, so are the jinas.

source: །སངས་རྒྱས་བསམ་དུ་མེད་པ་ཡིས།
en: The inconceivable Buddha

source: །བསམ་པ་འདི་ནི་རབ་ཏུ་བསྟན། །གཅིག་པུ་དབེན་སོང་གང་སེམས་པ།
en: Has taught these thoughts. {101}

source: །ནམ་ཞིག་སེམས་པ་མེད་པར་འགྱུར།
en: “When will thoughts cease for those Who think of being alone in solitude?

source: །བསམ་པ་དག་ནི་མི་སེམས་ན།
en: When they do not think that thought

source: །བསམ་པ་ཐམས་ཅད་མེད་པར་འགྱུར།
en: Then all thoughts will cease to be. {102}

source: །ཤི་འཕོས་དུས་བྱས་ཤི་བའི་ཚེ། །གང་གི་བསམ་པ་རབ་འཇུག་པ།
en: “When it comes to the time of death And their thoughts are continuing,

source: །བསམ་པའི་རྗེས་སུ་རྣམ་ཤེས་འབྲང་།
en: Their consciousness will follow the thoughts

source: །བསམ་ལས་དེ་ནི་མི་ཐར་ཏོ།
en: And they will not be free from thought. {103}

source: །སུ་དག་བུད་མེད་འདུ་ཤེས་གནས།
en: “If a man retains the concept of a woman,

source: །དེ་དག་འདོད་ཆགས་རབ་ཏུ་འཕེལ།
en: His desire will continue to arise.

source: །འདུ་ཤེས་དག་ནི་རྣམ་བཤིག་ན།
en: If this concept has ceased

source: །འདོད་ཆགས་ཀྱིས་ནི་གོས་མི་འགྱུར།
en: He will not be stained by desire. {104}

source: །བསམ་པ་འདི་ནི་བསམ་པ་ཆེ།
en: “This thought is a great thought;

source: །ཆོས་ཀྱི་བསམ་པ་བླ་ན་མེད།
en: It is the unsurpassable thought of the Dharma.

source: །ཆོས་ཀྱི་བསམ་པ་འདི་ཡིས་ནི།
en: Through this thought of the Dharma

source: །ཡང་དག་བསམ་པ་རབ་ཏུ་འབྱུང་།
en: There will be a continuity of correct thoughts. {105}

source: །ཚུལ་མ་ཡིན་པ་རྣམ་བསམས་པས།
en: “Through incorrect thought

source: །བསམ་པ་བསམ་ཡས་མང་པོ་དག །ཡུན་རིང་དུས་སུ་རྣམ་བསམས་ཀྱང་།
en: There will be numerous, countless thoughts, And though one thinks for a very long time

source: །བསམ་པ་དག་ནི་ཟད་མ་གྱུར།
en: There will still be no cessation to thinking. {106}

source: །གང་དག་མིང་ལ་སེམས་པ་ཡང་།
en: “When someone has the thought of a name,

source: །ཟད་པ་ལ་ནི་ཡེ་ཤེས་མེད།
en: In that cessation there is no wisdom.

source: །སྒྲ་ཤེས་པ་ལ་ཟད་པ་མེད།
en: There is no cessation in the knowledge of a word—

source: །ཟད་པའི་ཆོས་ཉིད་དེ་ཡིན་ནོ།
en: That is the nature of cessation. {107}

source: །སྒྲ་དང་རྣམ་རིག་ཚིག་གི་ལམ།
en: “Through words, speech, and communication,

source: །ཟད་པའི་སྒྲར་ནི་བསྟན་པ་སྟེ།
en: Phenomena are taught using the term cessation.

source: །ཆོས་དེ་རྣམས་ནི་བྱེ་བྲག་མེད། །ཤེས་བཞིན་ཟད་པ་དེ་བཞིན་ཏེ།
en: Between phenomena there is no distinction, And through knowing that there is cessation; {108} “Even if it is explained for ten million eons

source: །མ་སྐྱེས་ཤིང་ནི་མ་འགགས་པ།
en: That they are unproduced and unceasing,

source: །མཚན་མ་མེད་ཅིང་མཚན་ཉིད་མེད། །བསྐལ་པ་བྱེ་བར་བཤད་ཀྱང་ནི།
en: Without attributes and without characteristics,

source: །མཚན་མ་མེད་པར་བསྟན་པ་ཡིན། །དངོས་པོ་ཐམས་ཅད་རྣམ་བཤིག་ནས།
en: They are taught to be without attributes. {109} “When all existents have ceased to exist

source: །དངོས་པོ་མེད་ལ་རབ་གནས་པ།
en: And they remain in nonexistence,

source: །དངོས་པོ་གཞན་དུ་མ་བསྟན་ཏེ།
en: Existence is not taught to be other than nonexistence,

source: །དངོས་མེད་པ་ཡང་གཞན་མི་བསྟན།
en: And nonexistence is not taught to be other than existence. {110}

source: །དངོས་མེད་སྒྲར་ནི་རིག་བྱས་ཏེ།
en: “The teaching of nonexistence

source: །དངོས་པོ་མེད་པ་རབ་ཏུ་བསྟན།
en: Is given through the word nonexistence,

source: །སངས་རྒྱས་དག་ནི་ཀུན་གྱིས་ཀྱང་།
en: But not even all the buddhas

source: །དངོས་པོ་མེད་པ་བལྟར་མི་ནུས།
en: Can see nonexistence. {111}

source: །དངོས་པོ་ཀུན་གྱི་དངོས་པོ་ནི།
en: “That which exists is taught

source: །དངོས་པོ་མེད་པར་དེ་བསྟན་ཏེ།
en: As this nonexistence of all that exists.

source: །དེ་ལྟར་དངོས་པོ་རྣམ་རིག་ནི།
en: Knowing existents in this way,

source: །དངོས་པོ་མེད་པར་འགྱུར་ཞེས་བསྟན།
en: They are taught to be nonexistent. {112} “There is no one whosoever

source: །དངོས་པོ་མེད་པ་དེ་ཡང་ནི། །སུས་ཀྱང་ནམ་དུ་རེག་མི་ནུས།
en: Who can connect with this nonexistence.

source: །དངོས་པོ་མེད་པ་རེག་པ་ཡིས།
en: The connection with this nonexistence

source: །ཀུན་རྫོབ་ཏུ་ནི་དེ་བསྟན་ཏོ།
en: Results in a teaching that is one of conventions. {113}

source: །འཇིག་རྟེན་སངས་རྒྱས་བདག་འགྱུར་སྙམ། །དེ་ལྟར་གང་གི་བློ་འགྱུར་བ།
en: “The ones who have in their minds the thought ‘I shall become a buddha in this world’

source: །སྲིད་པའི་སྲེད་པས་ཡོང་མི་གཟིར།
en: Will not be afflicted by craving for existence,

source: །མཁས་པ་བྱང་ཆུབ་རྟོགས་པར་འགྱུར།
en: And those wise ones will attain enlightenment. {114}

source: །བྱང་ཆུབ་སེམས་དཔའ་མཉམ་བཞག་པ།
en: “The bodhisattvas in meditation

source: །ཆོས་ནི་གང་ལའང་སྨོན་མི་བྱེད།
en: Do not long for any phenomenon.

source: །ཅི་ཡང་མེད་ཅིང་དམིགས་པ་མེད།
en: When nothing is apprehended,

source: །དེ་ནི་བྱང་ཆུབ་བརྗོད་པ་ཡིན། །བྱང་ཆུབ་ཏུ་ནི་ངེས་ཞུགས་ཤེས།
en: That is called enlightenment. {115}

source: །མང་དུ་དེ་སྐད་སྨྲ་མོད་ཀྱི།
en: “There are many who say, ‘I am in a state of enlightenment,’

source: །དེ་དག་སངས་རྒྱས་བྱང་ཆུབ་རིང་།
en: They are far from buddhahood’s enlightenment. {116} “The Dharma that is taught through words

source: །འདུ་བྱེད་ཐམས་ཅད་སྟོང་པར་ནི། །སྒྲ་ཡིས་ཆོས་རྣམས་རབ་ཏུ་བཤད།
en: Is entirely composite and empty.

source: །སྒྲ་ཡི་རང་བཞིན་གང་ཡིན་པ།
en: The nature of these words

source: །ཟབ་ཅིང་ཕྲ་སྟེ་མཐོང་བར་དཀའ། །མངོན་ཤེས་ཆེ་ལ་མདོ་སྡེ་འདི།
en: Is profound, subtle, and difficult to see. {117} “It is through great higher cognition That the teaching of this sūtra is given.

source: །ངེས་པར་བསྟན་ཞེས་བྱ་བ་ཡིན།
en: It is taught by all the buddhas

source: །བྱང་ཆུབ་སེམས་དཔའི་དོན་ཕྱིར་ནི། །སངས་རྒྱས་རྣམས་ཀྱིས་བསྟན་མཛད་དོ།
en: For the sake of the bodhisattvas. {118} “Remedies defeat

source: །ཀུན་ནས་ཉོན་མོངས་ཇི་སྙེད་པ། །གཉེན་པོ་ཐམས་ཅད་དེ་ཡིས་བཅོམ།
en: However many kleśas they have.

source: །མངོན་པར་ཤེས་ལ་རབ་གནས་ཤིང་།
en: Remaining in higher cognition,

source: །དེ་དག་རྫུ་འཕྲུལ་ཤིན་ཏུ་བསྒོམས།
en: They cultivate miraculous powers. {119}

source: །བསམས་ནས་ཤེས་ལ་དེ་གནས་ཏེ།
en: “They maintain the knowledge of contemplation

source: །ཤེས་པ་དེ་ཡང་རྣམ་པར་བཤིག །བསམ་གྱིས་མི་ཁྱབ་དཔག་མེད་ཀྱི།
en: And then that knowledge also ceases. There is an insatiable acquisition

source: །ཡེ་ཤེས་ཐོབ་པས་ངོམས་པ་མེད།
en: Of inconceivable, immeasurable wisdom. {120}

source: །ཏིང་ངེ་འཛིན་དང་རྫུ་འཕྲུལ་ཕྱིར།
en: “Their samādhi and miraculous actions

source: །དེ་དག་མངོན་པར་འདུ་བྱེད་མེད།
en: Are devoid of mentation.

source: །དཔའ་བོའི་རྣམ་སྨིན་དེ་ཡིན་ཏེ།
en: Such is the ripening of these heroes

source: །དུས་ཀུན་དུ་ཡང་མཉམ་པར་བཞག །རྣམ་སྨིན་སྐྱེས་པའི་རྫུ་འཕྲུལ་གྱིས།
en: Who are always in a state of meditation. {121} “With these ripened miraculous powers

source: །ཞིང་ནི་བྱེ་བར་དེ་འགྲོ་སྟེ།
en: They go to millions of realms

source: །འཇིག་རྟེན་སྒྲོན་མ་མཐོང་བ་ནི།
en: And they see those who are the illumination of the worlds,

source: །གང་གཱ་དག་གི་བྱེ་མ་སྙེད།
en: Who are as numerous as the sands of the Ganges. {122}

source: །དེ་དག་འཆི་འཕོ་སྐྱེ་བ་ཡང་།
en: “Their births and their deaths

source: །སེམས་གཞན་དུ་ནི་སྒྱུར་བར་བྱེད།
en: Are the processes of their minds.

source: །སེམས་ལ་དབང་ཡང་ཐོབ་པས་ན།
en: They have attained power over their minds

source: །དེ་དག་ལུས་ནི་འོད་གསལ་ལོ།
en: And their bodies are bright. {123}

source: །སངས་རྒྱས་དག་གི་ཉན་ཐོས་གང་། །བསྒོམས་པའི་རྫུ་འཕྲུལ་གནས་པ་ནི།
en: “The Buddha’s śrāvakas who maintain

source: །འདུ་བྱེད་མེད་པའི་རྫུ་འཕྲུལ་ལ། །དེ་དག་བཅུ་དྲུག་ཆར་མི་ཕོད།
en: The miraculous powers they have cultivated Do not even approach a sixteenth fraction Of the miraculous activities free of mentation. {124}

source: །ལྷ་རྣམས་ཀྱིས་ཀྱང་དེ་དག་གི།
en: “All the devas are unable

source: །བསམ་པ་ཤེས་པར་མི་ནུས་ཏེ།
en: To know their thoughts.

source: །འཇིག་རྟེན་གྱི་ནི་མགོན་པོ་དང་། །དེ་དག་མཚུངས་གནས་མ་གཏོགས་སོ།
en: Only the lords of the worlds, And those who are equal to them, can do so. {125}

source: །དེ་དག་སྤྱི་ཅེར་མི་འགྱུར་ཏེ།
en: “They do not become bald

source: །མགོ་ལ་སྐྲ་དཀར་མི་འབྱུང་ཞིང་།
en: And their hair does not become white.

source: །རགས་པའི་རྒ་བ་མི་འབྱུང་སྟེ།
en: They do not have evident aging

source: །དེ་བཞིན་སྡུག་བསྔལ་འཆི་བ་མེད།
en: And thus have no suffering or death. {126}

source: །ཐེ་ཚོམ་ཡིད་གཉིས་མི་འབྱུང་སྟེ།
en: “They do not have doubt or mistrust

source: །དེ་དག་ལ་ནི་ནེམ་ནུར་མེད།
en: And they have no uncertainty.

source: །མདོ་སྡེ་བྱེ་བ་བརྒྱ་རྣམས་ནི། །ཉིན་མཚན་དུ་ཡང་དེ་དག་ཚོལ།
en: Day and night they seek for Thousands of millions of sūtras. {127}

source: །ཇི་སྙེད་ཀུན་ནས་ཉོན་མོངས་ཀྱི།
en: “All their propensities

source: །བག་ལ་ཉལ་ནི་རབ་ཏུ་སྤངས།
en: For the kleśas are eliminated.

source: །དེ་དག་སེམས་ཅན་ཐམས་ཅད་ལ། །རྟག་ཏུ་མཉམ་པའི་སེམས་སུ་འགྱུར།
en: They always have an equal mind Toward all beings. {128}

source: །ཏིང་འཛིན་བྱེ་བ་ཁྲག་ཁྲིག་རྣམས།
en: “They teach quintillions of samādhis

source: །ཕྱོགས་བཅུ་དག་ཏུ་ངེས་པར་སྟོན།
en: Throughout the ten directions. Without respite they answer

source: །དྲིས་པ་བྱེ་བ་སྟོང་རྣམས་ཀྱང་། །མི་གནས་པར་ནི་ལུང་སྟོན་ཏོ།
en: Thousand of millions of questions. {129}

source: །ཕོ་དང་མོར་ནི་འདུ་ཤེས་དང་། །འདུ་ཤེས་ཐམས་ཅད་རྣམ་པར་བཤིག །དངོས་མེད་འདུ་ཤེས་གནས་ནས་ནི།
en: “The concept of male, the concept of female, And all other concepts have ceased. They remain in the recognition of nonexistence

source: །ཡང་དག་ངེས་པར་སྟོན་པར་བྱེད།
en: And they teach that which is certain and true. {130}

source: །ཡོངས་སུ་དག་པའི་ཡེ་ཤེས་ཀྱིས།
en: “With completely pure wisdom

source: །ཇི་བཞིན་དུ་ནི་ཆོས་སྟོན་ཏོ།
en: They teach the Dharma correctly.

source: །ཆོས་རྣམས་ཡང་དག་བསྟན་ལ་བརྩོན།
en: They are dedicated to proclaiming the Dharma,

source: །ཏིང་འཛིན་ཡེ་ཤེས་སྤྱོད་ཡུལ་ལྡན།
en: And are in the domain of samādhi and wisdom. {131}

source: །དེ་ཡི་ཏིང་འཛིན་སྤྱོད་པ་ཡང་།
en: “Though they practice dhyāna,

source: །དངོས་པོ་དག་ལ་མི་གནས་ཏེ།
en: They do not remain in existence.

source: །དེ་ཡི་ཚིག་ཀྱང་དོན་མེད་མིན།
en: Their words are not meaningless;

source: །ཆོས་བསྟན་པ་ཡང་འབྲས་བུ་ཡོད།
en: Their teaching of the Dharma is fruitful. {132}

source: །མདོ་སྡེ་འདི་ལ་སུ་དགའ་བ།
en: “Those who delight in this sūtra

source: །དེས་ནི་མིར་འགྱུར་ལེགས་པར་འཐོབ།
en: Will easily become human,

source: །མི་ཁོམ་ཐམས་ཅད་རབ་ཏུ་སྤངས།
en: Avoid all disadvantageous existences,

source: །སངས་རྒྱས་ཀུན་ལ་བྱས་པ་གཟོ།
en: And repay the kindness of all the buddhas. {133} “Those who possess one verse

source: །གང་གིས་རིན་ཆེན་མདོ་འདི་ལས། །ཚིག་བཞིའི་ཚིགས་བཅད་བཟུང་བ་ཡང་།
en: Of this precious sūtra

source: །དེས་ནི་འཁོར་བ་གང་བོར་བ།
en: Will abandon saṃsāra

source: །བསྐལ་པ་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: For countless eons. {134}

source: །དེ་དག་སངས་རྒྱས་ཀུན་གྱིས་གཟིགས།
en: Are seen by all the buddhas.

source: །དེ་ནི་སངས་རྒྱས་རི་མོར་བྱས།
en: They will serve the buddhas

source: །མྱུར་དུ་བྱང་ཆུབ་ཐོབ་པར་འགྱུར།
en: And quickly attain enlightenment. {135}

source: །མདོ་སྡེ་འདི་ལ་སུ་དགའ་བ། །དེ་དག་ཆོས་རྣམས་ཐམས་ཅད་ལ།
en: “Those who delight in this sūtra,

source: །ཐེ་ཚོམ་དང་ནི་ནེམ་ནུར་མེད།
en: They will have no doubt or uncertainty Concerning the entire Dharma,

source: །དེ་དག་མྱ་ངན་འདས་དང་ཉེ། །བྱ་རྒོད་ཕུང་པོར་དེ་བཞིན་གཤེགས།
en: And they are near to nirvāṇa. {136}

source: །དཔའ་བོ་ཆེན་པོ་དེ་ཡིས་མཐོང་།
en: “They will see a great hero, A tathāgata on Gṛdhrakūṭa.

source: །ཐམས་ཅད་སངས་རྒྱས་ལུང་བསྟན་ཏེ། །རྒྱལ་བ་བྱམས་པ་མཐོང་བར་འགྱུར།
en: All the buddhas will give them prophecies And they will appear to be compassionate jinas. {137} “Those who follow this sūtra In this time of destruction

source: །སངས་རྒྱས་བྱམས་པ་མཐོང་ནས་ནི།
en: Will see Buddha Maitreya

source: །བཟོད་པ་བཟང་པོ་ཐོབ་པར་འགྱུར། །གང་སུ་ཟད་པའི་དུས་ལ་ཡང་། །མདོ་སྡེ་འདི་ལ་རབ་གནས་པ།
en: And attain excellent patience. {138}

source: །དེ་དག་ཡང་དག་མཐའ་ལ་གནས།
en: “They will remain at the summit of existence,

source: །ཡང་དག་མཐའ་ནི་བསམ་མི་ཁྱབ།
en: The inconceivable summit of existence,

source: །བསམ་གྱིས་མི་ཁྱབ་མཐའ་ལ་ནི།
en: And at that inconceivable summit They will know no doubt. {139}

source: །དེ་དག་ནེམ་ནུར་ཡོད་མ་ཡིན།
en: “They will not have any doubt at all,

source: །རྡུལ་ཕྲན་ཙམ་ཡང་རྣམ་པ་ཀུན། །དེ་དག་ལ་ཡང་ཐེ་ཚོམ་མེད།
en: Not even an atom of doubt.

source: །རྡུལ་ཙམ་རབ་ཏུ་སྤངས་པ་ནི།
en: As they have eliminated every atom of doubt,

source: །དེ་དག་བྱང་ཆུབ་རྙེད་མི་དཀའ།
en: Enlightenment will not be difficult to attain. {140}

source: །ཟད་དུས་ཤིན་ཏུ་འཇིགས་པ་ལ།
en: “In the terrifying age of destruction

source: །དཀའ་བ་དག་ནི་སྤྱད་བྱས་ཏེ།
en: They will undergo hardship,

source: །མདོ་སྡེ་རིན་ཆེན་འདི་བསླབས་ན།
en: Train in this precious sūtra,

source: །སྤོབས་པ་དག་ཀྱང་མི་ཟད་འགྱུར།
en: And have an unceasing eloquence. {141}

source: །མདོ་སྡེ་འདི་ནི་རབ་བཏོན་ན།
en: “They will promulgate this sūtra

source: །སངས་རྒྱས་རྣམས་ཀྱི་མཛོད་བསྲུངས་ཏེ།
en: And will guard the treasure of the buddhas.

source: །འདི་ནི་སངས་རྒྱས་ཀུན་མཆོད་པ།
en: This is an offering to all the buddhas,

source: །ཆོས་ཀྱི་མཆོད་པ་བསམ་མི་ཁྱབ།
en: An inconceivable offering of the Dharma. {142} “Those who maintain this sūtra

source: །མ་རུངས་ཟད་པའི་དུས་ལ་ནི། །མདོ་སྡེ་འདི་དག་གང་འཛིན་པ།
en: During the cruel age of destruction

source: །དེ་དག་ཡེ་ཤེས་རྙེད་མི་དཀའ།
en: Will without difficulty attain wisdom,

source: །གང་གིས་སྔོན་གྱི་སངས་རྒྱས་ལས། །མདོ་སྡེ་འདི་དག་བཟུང་བ་ནི།
en: From the buddhas of the past

source: །དེ་དག་ལུས་ལ་འཆང་གྱུར་ཏེ།
en: Will come into possession of it

source: །ཟད་པའི་དུས་ལ་རབ་ཏུ་འདོན། །སངས་རྒྱས་ཞིང་ནི་བྱེ་བར་ཡང་།
en: And promulgate it in the age of destruction. {144}

source: །འཇིག་རྟེན་མགོན་པོའི་སྤྱན་སྔར་ཡང་།
en: “Their voices will proclaim

source: །ཤཱཀྱ་སེང་གེའི་སྤྱོད་པ་རྣམས།
en: The conduct of the Śākya lion In the presence of lords of the world

source: །དེ་དག་སྒྲར་ཡང་སྒྲོག་པར་འགྱུར།
en: In millions of buddha realms. {145}

source: །དེ་དག་སངས་རྒྱས་སྤྱན་སྔར་ནི།
en: “And in the presence of the buddhas

source: །རྟག་ཏུ་སེང་གེའི་སྒྲ་སྒྲོག་སྟེ།
en: They will always roar the lion’s roar

source: །མཐའ་ཡས་པ་ཡི་སྤོབས་པ་ཡིས། །སངས་རྒྱས་བྱང་ཆུབ་འདི་ཡང་སྨྲ།
en: With an endless confidence of speech, Teaching the enlightenment of buddhahood. {146} “Those who have been prophesied by the Buddha Will be born into the Ikṣvāku family. They will protect this enlightenment

source: །ཟད་དུས་འཇིགས་པ་ཆེན་པོའི་ཚེ། །བྱང་ཆུབ་འདི་ནི་གང་སྲུང་བ། །བུ་རམ་ཤིང་གི་རིགས་སྐྱེས་རྣམས། །སངས་རྒྱས་རྣམས་ཀྱིས་ལུང་བསྟན་ཡིན།
en: During the terrifying age of destruction. {147}

source: །དེ་དག་གཟུགས་ནི་ཕུན་སུམ་ཚོགས།
en: “Their bodies will be perfect,

source: །མཚན་རྣམས་ཀྱིས་ཀྱང་རྣམ་པར་བརྒྱན།
en: Adorned by the primary signs of a great being. They will send emanations

source: །སངས་རྒྱས་བྱེ་བར་ཕྱག་འཚལ་དུ། །རྣམ་པར་འཕྲུལ་པས་འགྲོ་བར་འགྱུར།
en: To make homage to millions of buddhas. {148} “There will be the manifestation

source: །སྒྱུ་མ་ཡི་ནི་མེ་ཏོག་དག །གསེར་གྱི་མདོག་འདྲར་སྣང་བ་དང་། །བཻ་དཱུརྱ་དང་ཤེལ་དག་དང་། །དངུལ་གྱི་ཡང་ནི་མེ་ཏོག་རྣམས།
en: Of golden, illusory flowers, And flowers made of beryl, Of crystal, and of silver, {149}

source: །རིན་ཆེན་རིགས་རྣམས་ཐམས་ཅད་ཀྱང་།
en: “And every kind of jewel

source: །དེ་ཡི་ལག་ནས་འབྱུང་བར་འགྱུར།
en: Appearing from their hands, Which they will scatter toward the buddhas

source: །བྱང་ཆུབ་ལམ་རྣམས་ཚོལ་བའི་ཕྱིར། །དེ་དག་སངས་རྒྱས་རྣམས་ལ་འཐོར།
en: In seeking the path to enlightenment. {150}

source: །མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་དང་། །རོལ་མོ་སྒྲུབ་པ་ཕུན་སུམ་ཚོགས།
en: “Various kinds of offerings, And perfectly created music,

source: །བ་སྤུའི་ཁུང་ནས་འབྱུང་བར་འགྱུར།
en: Will be emitted from the pores of their bodies. {151}

source: །གང་དག་སྒྲ་འདི་ཐོས་པ་ནི།
en: Who hear that music

source: །སངས་རྒྱས་ཡེ་ཤེས་བླ་མེད་ལས། །དེ་དག་ཕྱིར་ཡང་མི་ལྡོག་འགྱུར།
en: Will progress irreversibly toward Buddhahood’s highest wisdom. {152}

source: །སངས་རྒྱས་བྱེ་བ་དེ་དག་གི། །བསྔགས་པ་བསམ་གྱིས་མི་ཁྱབ་བརྗོད། །བསམ་གྱིས་མི་ཁྱབ་ཞིང་རྣམས་སུ།
en: “Those millions of buddhas Recite countless praises

source: །དེ་དག་སྒྲ་ཡང་ཐོས་པར་འགྱུར།
en: And their sound is heard Within countless realms. {153}

source: །གང་གིས་སྒྲ་དེ་ཐོས་པ་ནི།
en: “For those who hear that sound

source: །དེ་དག་འདུ་ཤེས་འགགས་པར་འགྱུར།
en: All their conceptualization ceases.

source: །འདུ་ཤེས་དག་ནི་འགགས་ནས་སུ།
en: When their conceptualization has ceased

source: །སངས་རྒྱས་མཐའ་ཡས་མཐོང་བར་འགྱུར།
en: They will see endless buddhas. {154}

source: །དེ་འདྲ་བ་ཡི་ཡེ་ཤེས་ཀྱིས།
en: “With that kind of wisdom

source: །བྱང་ཆུབ་སྤྱོད་པ་སྤྱད་ནས་ནི།
en: They will practice bodhisattva conduct.

source: །སེམས་ཅན་ཀུན་གྱི་དོན་བྱས་ནས།
en: They will benefit all beings

source: །དོན་བྱེད་པ་ཡི་རྒྱལ་བར་འགྱུར།
en: And become jinas who benefit others. {155}

source: །གང་གིས་ཏིང་འཛིན་བཟུང་བ་ཡི།
en: “Those who possess this samādhi

source: །མཁས་པས་འདིར་ནི་གང་འཐོབ་པ།
en: Are wise ones who will obtain

source: །ཡོན་ཏན་ཕན་ཡོན་འདི་དག་སྟེ།
en: These benefits and qualities,

source: །གཞན་ཡང་དཔག་ཏུ་མེད་པར་འགྱུར།
en: And also countless others. {156}

source: །བུད་མེད་ཀྱིས་ཀྱང་མདོ་སྡེ་འདི། །ཐོས་ནས་ཚིགས་བཅད་གཅིག་བཟུང་ན།
en: “Even a female who hears This sūtra and retains a single verse

source: །བུད་མེད་དངོས་པོ་རྣམ་བསྒྱུར་ནས།
en: Will change from having a female existence

source: །ཆོས་སྨྲ་བ་ཡང་དེ་འགྱུར་རོ།
en: And will become a dharmabhāṇaka. {157}

source: །དེ་ནི་ཕྱིས་ཀྱང་བུད་མེད་ཀྱི།
en: “She will never again afterward Have a female existence,

source: །དངོས་པོ་འཛིན་པར་མི་འགྱུར་ཏེ།
en: And will always be handsome

source: །མཚན་རྣམས་ཀྱིས་ནི་ལེགས་བརྒྱན་ཅིང་།
en: And adorned by the primary signs of a great being. {158}

source: །རྟག་ཏུ་བྱད་བཞིན་བཟང་པོར་འགྱུར།
en: “They will all come to possess

source: །མདོ་སྡེ་མཆོག་རབ་འདི་ཡི་ནི། །ཡོན་ཏན་དག་ཀྱང་མཆོག་བཤད་པ། །དེ་ལ་དེ་དག་ཐམས་ཅད་འབྱུང་།
en: These supreme qualities Described in this supreme sūtra,

source: །བྱང་ཆུབ་ཉིད་ཀྱང་མྱུར་དུ་འཐོབ།
en: And they will quickly attain enlightenment. {159} “Having obtained this sūtra,

source: །སངས་རྒྱས་ཀུན་གྱི་སྤྱོད་ཡུལ་ཏེ། །མདོ་སྡེ་འདི་ནི་བཟུང་ནས་སུ།
en: Which is the domain of all the buddhas,

source: །དེ་དག་སྐྱེ་བ་ཐམས་ཅད་དུ།
en: Throughout all their lifetimes

source: །རྟག་ཏུ་འཇིགས་པ་མེད་པར་འགྱུར། །ཏིང་འཛིན་ཞི་བ་བཤད་པ་ནི།
en: They will always be without fear. {160} “Teaching this samādhi, this peace

source: །བྱང་ཆུབ་སེམས་དཔའ་སྐྱེད་པ་སྟེ།
en: Is the creation of bodhisattvas.

source: །བྱང་ཆུབ་རྟོགས་པར་སུ་འདོད་པ།
en: Whoever wishes to attain enlightenment

source: །མདོ་སྡེ་འདི་ནི་བརྗོད་པར་གྱིས།
en: Should give the teaching of this sūtra. {161}

source: །དེ་དག་ཐུབ་དབང་བསྙེན་པ་སྟེ།
en: “They will be close to the lords of sages

source: །སངས་རྒྱས་བྱང་ཆུབ་ཉེ་བར་འགྱུར།
en: And will be close to buddhahood’s enlightenment.

source: །དེ་དག་རིང་པོར་མི་ཐོགས་པར།
en: They will before long attain

source: །མཉམ་གཞག་ཞི་བའི་ས་འདི་ཐོབ།
en: This level of peace and meditation. {162}

source: །བྱང་ཆུབ་སེམས་དཔའ་དཔའ་བོ་དག །བྱང་ཆུབ་དེ་ལ་རྟག་གནས་ནས།
en: “The bodhisattvas, the heroes, Always remain in this enlightenment.

source: །སངས་རྒྱས་དག་ནི་བྱེ་བ་རྣམས། །གང་གཱའི་བྱེ་སྙེད་མཐོང་བར་འགྱུར།
en: They see millions of buddhas

source: །ཏིང་འཛིན་རྡུལ་བྲལ་ཞི་བ་འདི་ནི་དེས་ཐོབ་ནས།
en: As numerous as the Ganges sands. {163}

source: །ས་བདག་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་དེ་འགྱུར་ཏེ།
en: “They will become cakravartin kings who rule the world,

source: །སངས་རྒྱས་རྡུལ་བྲལ་ཤིན་ཏུ་སེམས་ཞི་རྣམས་མཐོང་ནས།
en: See stainless buddhas who have minds of perfect peace,

source: །འཇིག་རྟེན་མགོན་པོ་དེ་དག་ཚིགས་བཅད་བརྒྱས་སྟོད་འགྱུར།
en: Praise those lords of the worlds with hundreds of verses, And obtain the peace of this stainless samādhi. {164}

source: །ཤིན་ཏུ་གྲགས་པ་ཆེན་པོ་ལྷ་དང་མི་ཡི་མཆོག །འདྲེན་པ་དག་ལ་མཆོད་པ་མཚུངས་མེད་དེས་བྱས་ཏེ།
en: “They will make unequaled offerings to those guides Who have perfect, great fame and are supreme among humans and devas,

source: །དེས་ནི་རྒྱལ་སྲིད་མཆིལ་མ་བཞིན་དུ་ཡོངས་སྤངས་ནས།
en: And they will cast aside the kingdom like spittle,

source: །གཙང་ཞིང་རྣམ་པར་དག་པས་ཚངས་པའི་སྤྱད་པ་སྤྱོད།
en: And pure, perfectly pure, will practice celibacy. {165}

source: །དེ་ནི་ཐུབ་པ་མཆོག་གི་བསྟན་ལ་རབ་བྱུང་ནས།
en: “They will enter homelessness in the Sage’s teaching

source: །ཏིང་འཛིན་རྡུལ་བྲལ་ཞི་བ་འདི་ཡང་རབ་ཐོབ་སྟེ།
en: And obtain the peace of this stainless samādhi.

source: །དེ་ཡང་ཚིག་དགེ་དག་ཀྱང་ཤིན་ཏུ་འཇམ་གྱུར་ནས།
en: They will have friendly speech with gentle words,

source: །བློ་ལྡན་བྱིན་གྱིས་བརླབས་ཀྱིས་མདོ་སྡེ་བྱེ་བ་འཆད།
en: And become empowered and wise in teaching a million sūtras. {166} “Having attained this samādhi they will teach it to many beings:

source: །སྟོང་པ་མཚན་མེད་མཆོག་ཏུ་གྱ་ནོམ་ཞི་བའི་མཆོག །རབ་ཏུ་ཞི་ཆོས་སྤྱད་པ་ཞིབ་ཅིང་ཐོགས་པ་མེད།
en: Empty and without attributes, the perfect attainment of peace, The perfect and unimpeded practice of the Dharma of complete peace,

source: །ཤིན་ཏུ་ཞི་བ་རྟག་ཏུ་རྡུལ་བྲལ་རང་བཞིན་སྟོང་། །ཏིང་འཛིན་འདི་ཐོབ་སྐྱེ་བོ་མང་ལ་རབ་ཏུ་སྟོན།
en: The empty nature that is constant, stainless peacefulness. {167}

source: །བློ་ནི་རྟག་ཏུ་ཟབ་ཅིང་བློ་ཡང་མཐའ་ཡས་ཏེ།
en: “They have profound realization, continuous endless realization,

source: །བློ་ཡང་རྒྱ་ཆེ་དཔག་ཏུ་མེད་པའི་དོན་ལྡན་བློ།
en: A vast realization, a realization that is incalculably beneficial.

source: །ཟབ་ཅིང་ཞི་བའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་ནས་ནི།
en: Having attained profound peace, this samādhi,

source: །འཇིག་རྟེན་ཐམས་ཅད་དུ་ཡང་སྣང་བ་ཐོབ་པར་འགྱུར།
en: They will become an illumination for all worlds. {168}

source: །རྡུལ་དང་བྲལ་བའི་ཏིང་འཛིན་ཞི་བ་འདི་རྙེད་ན།
en: “Having attained this peace, this stainless samādhi,

source: །དེ་ནི་ཚངས་པར་སྤྱོད་པ་རྟག་ཏུ་གཙང་བར་འགྱུར།
en: They will be continually pure in celibacy,

source: །དྲི་ང་མེད་ཅིང་རྟག་ཏུ་ཀུན་ནས་ཉོན་མོངས་མེད།
en: Unsullied, always free of the kleśas,

source: །སེམས་ཅན་བྱེ་བ་གཞན་ཡང་དེ་ལ་འགོད་པར་འགྱུར།
en: And lead millions of other beings to be the same. {169}

source: །རྡུལ་དང་བྲལ་བའི་ཏིང་འཛིན་ཞི་བ་འདི་བཟུང་ན།
en: “Having attained this peace, this stainless samādhi,

source: །ཤེས་རབ་ཤིན་ཏུ་རྣོ་ཞིང་ཤེས་རབ་མཆོག་ཏུ་འགྱུར།
en: They will have exceedingly sharp wisdom, supreme wisdom;

source: །དེ་ཐོས་རྒྱ་མཚོར་འགྱུར་ཞིང་རྟག་ཏུ་བློ་མཐའ་ཡས།
en: They will gain an ocean of learning and always have infinite understanding,

source: །ངག་དགེ་བློ་གྲོས་མཁས་ཤིང་ཆོ་ག་ཤེས་པར་འགྱུར།
en: Virtuous speech, excellent understanding, and knowledge of the instructions. {170}

source: །ལས་ཀྱི་གནས་དང་དེ་བཞིན་བཟོ་ཡི་གནས་རྣམས་དང་། །སྨན་གྱི་གནས་རྣམས་དང་ནི་དེ་བཞིན་རྩི་ཡི་གནས།
en: They will gain skill in works and skill in the arts, Skill in healing and likewise skill in herbs.

source: །བརྟན་པ་དེ་ནི་ཐམས་ཅད་ཀྱི་ཡང་ཕ་རོལ་ཕྱིན།
en: In everything they will be constant and perfect. {171}

source: །སྙན་དངགས་བསྟན་བཅོས་བཞད་གད་རོལ་མོ་དང་། །གླུ་དང་གར་ལ་ཤིན་ཏུ་མཁས་ཤིང་ཕ་རོལ་ཕྱིན།
en: They will be perfect and completely skilled In poetry, treatises, comedy, music, song, and dance,
